# DimReferenceCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimReferenceCount Property
ParameterTypeId Class See Also
---
"Count"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimReferenceCount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimReferenceCount As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimReferenceCount {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace